## Preview of Terragrunt changes in 29c4c1a6e9e758f9a5d220e10eab972a832a3f8a

### Changed Stacks

```bash
azure/dev/westeurope/stack-a/rg
azure/dev/westeurope/stack-a/storage-account
```

#### Terragrunt Plan
<details><summary>Click to expand</summary>

```terraform
terramate: Entering stack in /azure/dev/westeurope/stack-a/rg
terramate: Executing command "terragrunt show -no-color out.tfplan"
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0mTerraform used the selected providers to generate the following execution
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0m  + create
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0mTerraform will perform the following actions:
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0m  # azurerm_resource_group.default will be created
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0m  + resource "azurerm_resource_group" "default" {
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0m      + id       = (known after apply)
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0m      + location = "westeurope"
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0m      + name     = "rg-agw-dev-we"
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0m    }
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0mPlan: 1 to add, 0 to change, 0 to destroy.
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0mChanges to Outputs:
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0m  + rg_id   = (known after apply)
[90m12:08:32.338 [0mSTDOUT [36mterraform: [0m  + rg_name = "rg-agw-dev-we"
terramate: Entering stack in /azure/dev/westeurope/stack-a/storage-account
terramate: Executing command "terragrunt show -no-color out.tfplan"
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0mTerraform used the selected providers to generate the following execution
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m  + create
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0mTerraform will perform the following actions:
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m  # azapi_resource.share["otel-config"] will be created
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m  + resource "azapi_resource" "share" {
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m      + body                      = {
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m          + properties = {
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m              + access_tier       = null
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m              + enabledProtocols  = null
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m              + metadata          = null
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m              + rootSquash        = null
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m              + shareQuota        = 1
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m              + signedIdentifiers = []
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m            }
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m        }
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m      + id                        = (known after apply)
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m      + ignore_casing             = false
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m      + ignore_missing_property   = true
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m      + name                      = "otel-config"
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m      + output                    = (known after apply)
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m      + parent_id                 = (known after apply)
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m      + removing_special_chars    = false
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m      + schema_validation_enabled = false
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m      + type                      = "Microsoft.Storage/storageAccounts/fileServices/shares@2023-01-01"
[90m12:08:36.537 [0mSTDOUT [36mterraform: [0m    }
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m  # azurerm_storage_account.this will be created
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m  + resource "azurerm_storage_account" "this" {
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + access_tier                        = "Hot"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + account_kind                       = "StorageV2"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + account_replication_type           = "LRS"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + account_tier                       = "Standard"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + allow_nested_items_to_be_public    = false
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + cross_tenant_replication_enabled   = false
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + default_to_oauth_authentication    = false
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + dns_endpoint_type                  = "Standard"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + enable_https_traffic_only          = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + https_traffic_only_enabled         = true
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + id                                 = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + infrastructure_encryption_enabled  = false
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + is_hns_enabled                     = false
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + large_file_share_enabled           = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + local_user_enabled                 = true
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + location                           = "westeurope"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + min_tls_version                    = "TLS1_2"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + name                               = "sastackawedev"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + nfsv3_enabled                      = false
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_access_key                 = (sensitive value)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_blob_connection_string     = (sensitive value)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_blob_endpoint              = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_blob_host                  = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_blob_internet_endpoint     = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_blob_internet_host         = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_blob_microsoft_endpoint    = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_blob_microsoft_host        = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_connection_string          = (sensitive value)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_dfs_endpoint               = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_dfs_host                   = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_dfs_internet_endpoint      = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_dfs_internet_host          = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_dfs_microsoft_endpoint     = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_dfs_microsoft_host         = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_file_endpoint              = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_file_host                  = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_file_internet_endpoint     = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_file_internet_host         = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_file_microsoft_endpoint    = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_file_microsoft_host        = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_location                   = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_queue_endpoint             = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_queue_host                 = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_queue_microsoft_endpoint   = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_queue_microsoft_host       = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_table_endpoint             = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_table_host                 = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_table_microsoft_endpoint   = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_table_microsoft_host       = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_web_endpoint               = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_web_host                   = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_web_internet_endpoint      = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_web_internet_host          = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_web_microsoft_endpoint     = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + primary_web_microsoft_host         = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + public_network_access_enabled      = true
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + queue_encryption_key_type          = "Service"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + resource_group_name                = "rg-stack-a-dev"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_access_key               = (sensitive value)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_blob_connection_string   = (sensitive value)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_blob_endpoint            = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_blob_host                = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_blob_internet_endpoint   = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_blob_internet_host       = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_blob_microsoft_endpoint  = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_blob_microsoft_host      = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_connection_string        = (sensitive value)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_dfs_endpoint             = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_dfs_host                 = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_dfs_internet_endpoint    = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_dfs_internet_host        = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_dfs_microsoft_endpoint   = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_dfs_microsoft_host       = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_file_endpoint            = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_file_host                = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_file_internet_endpoint   = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_file_internet_host       = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_file_microsoft_endpoint  = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_file_microsoft_host      = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_location                 = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_queue_endpoint           = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_queue_host               = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_queue_microsoft_endpoint = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_queue_microsoft_host     = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_table_endpoint           = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_table_host               = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_table_microsoft_endpoint = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_table_microsoft_host     = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_web_endpoint             = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_web_host                 = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_web_internet_endpoint    = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_web_internet_host        = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_web_microsoft_endpoint   = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + secondary_web_microsoft_host       = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + sftp_enabled                       = false
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + shared_access_key_enabled          = true
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + table_encryption_key_type          = "Service"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + tags                               = {
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + "application"    = "stack-a"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + "environment"    = "dev"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + "location"       = "westeurope"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + "resource-owner" = "marcopolo"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m        }
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + blob_properties {
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + change_feed_enabled      = false
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + default_service_version  = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + last_access_time_enabled = false
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + versioning_enabled       = true
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + container_delete_retention_policy {
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m              + days = 7
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m            }
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + delete_retention_policy {
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m              + days                     = 7
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m              + permanent_delete_enabled = false
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m            }
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m        }
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + identity {
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + principal_id = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + tenant_id    = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + type         = "SystemAssigned"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m        }
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + network_rules {
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + bypass                     = [
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m              + "AzureServices",
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m            ]
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + default_action             = "Allow"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + ip_rules                   = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + virtual_network_subnet_ids = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m        }
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m    }
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0mPlan: 2 to add, 0 to change, 0 to destroy.
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0mChanges to Outputs:
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m  + containers        = {}
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m  + fqdn              = {}
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m  + name              = "sastackawedev"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m  + private_endpoints = {}
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m  + queues            = {}
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m  + resource          = (sensitive value)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m  + resource_id       = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m  + shares            = {
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m      + otel-config = {
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + id   = (known after apply)
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m          + name = "otel-config"
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m        }
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m    }
[90m12:08:36.538 [0mSTDOUT [36mterraform: [0m  + tables            = {}
```

<!-- Sticky Pull Request Commentpreview -->